from telethon import TelegramClient, events
import re

# Ваші API ID та API Hash
api_id = '16751277'
api_hash = 'e74ac69e6428aeaad0180b8229d0d59b'
phone_number = '+380999162845'
target_chat_id = -4535035003  # Ваш ID чату

# Створюємо клієнт Telegram
client = TelegramClient('lead_generator_bot', api_id, api_hash)

# Розширений список ключових слів
keywords = {
    '#motiondesign': [
        'motion design', 'dynamic graphics', 'animated graphics', 'motion animation',
        'мошн дизайн', 'динамічна графіка', 'анімована графіка', 'створення анімації',
        'моушн дизайн', 'динамическая графика', 'анимация', 'создание анимации',
        'моушн дизайн', 'анімація', 'моушн графіка', '2D анімація', '3D анімація', 'створення анімації',
        'анімаційний ролик', 'відео дизайн', 'анімаційне відео', 'графічний дизайн', 'дизайн руху',
        'відео графіка', 'рекламна анімація', 'візуальні ефекти', 'динамічна графіка', 'моушн-дизайнер',
        'створити відео', 'анімація логотипу', 'відео-презентація', 'анімаційний банер', 'анімовані інфографіки',
        'відео для соціальних мереж', 'пояснювальні відео', 'дизайн для YouTube', 'стоп-моушн анімація', 'персонажі анімація',
        'відео для реклами', 'анімовані елементи', 'професійний аніматор', 'мультфільми', '3D візуалізація', 'анімовані графіки',
        'дизайн ілюстрацій', 'візуалізація даних', 'анімовані переходи', 'відео для бренду', 'графічні анімації', 'титри для відео',
        'анімовані стікери', 'трендові анімації', 'креативні відео', 'сучасні дизайни', 'анімація для мобільних додатків', 'відео для веб-сайтів',
        'передача ідей через відео', 'музичні анімації', 'відео-експлейнери', 'документальні анімації', 'дизайн персонажів', 'анімація для ігор',
        'анімовані об’єкти', 'дизайн візуалізації', 'дизайнер анімації', 'комп’ютерна анімація', 'дизайн реклами', 'анимация для YouTube', 'анимированные фоны', 'творча анимация',
        'продвижение видео', 'разработка анимации', 'анимированный контент', 'создание графики', 'анимация текста', 'интерактивная анимация', 'видео с эффектами', 'тренды в анимации',
        'стили анимации', 'постановка анимации', 'обработка видео', 'анимированные заставки', 'анимация логотипов', 'моушн маркетинг', 'анимация для рекламы', 'инфографика в анимации',
        'motion design', 'animation', 'motion graphics', '2D animation', '3D animation', 'creating animation', 'animated video', 'video design', 'animation video', 'graphic design',
        'motion design services', 'video graphics', 'advertising animation', 'visual effects', 'dynamic graphics', 'motion designer', 'create video', 'logo animation', 'video presentation',
        'animated banner', 'animated infographics', 'social media videos', 'explainer videos', 'YouTube design', 'stop motion animation', 'character animation', 'advertising videos',
        'animated elements', 'professional animator', 'cartoons', '3D visualization', 'animated graphics', 'illustration design', 'data visualization', 'animated transitions',
        'branding video', 'graphic animations', 'video titles', 'animated stickers', 'trending animations', 'creative videos', 'modern designs', 'app animations', 'website videos',
        'communicating ideas through video', 'music animations', 'video explainers', 'documentary animations', 'character design', 'game animations', 'animated objects', 'visualization design',
        'animation designer', 'computer animation', 'advertising design', 'YouTube animation', 'animated backgrounds', 'creative animation', 'video promotion', 'animation development',
        'animated content', 'graphics creation', 'text animation', 'interactive animation', 'video with effects', 'animation trends', 'animation styles', 'animation staging',
        'video processing', 'animated intros', 'logo animations', 'motion marketing', 'advertising animation', 'infographics in animation', 'моушн дизайн', 'анимация', 'моушн графика',
        '2D анимация', '3D анимация', 'создание анимации', 'анимационный ролик', 'видео дизайн', 'анимационное видео', 'графический дизайн', 'услуги моушн дизайна', 'видеографика',
        'рекламная анимация', 'визуальные эффекты', 'динамическая графика', 'моушн-дизайнер', 'создать видео', 'анимация логотипа', 'видеопрезентация', 'анимационный баннер',
        'анимированные инфографики', 'видео для соцсетей', 'поясняющие видео', 'дизайн для YouTube', 'стоп-моушн анимация', 'персонажи анимация', 'рекламные видео',
        'анимированные элементы', 'профессиональный аниматор', 'мультфильмы', '3D визуализация', 'анимированные графики', 'дизайн иллюстраций', 'визуализация данных',
        'анимированные переходы', 'видео для бренда', 'графические анимации', 'титры для видео', 'анимированные стикеры', 'трендовые анимации', 'креативные видео',
        'современные дизайны', 'анимация для мобильных приложений', 'видео для веб-сайтов', 'передача идей через видео', 'музыкальные анимации', 'видео-эксплейнеры',
        'документальные анимации', 'дизайн персонажей', 'анимация для игр', 'анимированные объекты', 'дизайн визуализации', 'дизайнер анимации', 'компьютерная анимация',
        'дизайн рекламы', 'анимация для YouTube', 'анимированные фоны', 'творческая анимация', 'продвижение видео', 'разработка анимации', 'анимированный контент',
        'создание графики', 'анимация текста', 'интерактивная анимация', 'видео с эффектами', 'тренды в анимации', 'стили анимации', 'постановка анимации', 'обработка видео',
        'анимированные заставки', 'анимация логотипов', 'моушн маркетинг', 'анимация для рекламы', 'инфографика в анимации'

    ],
    '#webdev': [
        'website development', 'web development', 'website creation', 'website design', 'site creation',
        'site design', 'building websites', 'front-end', 'back-end', 'web dev',
        'розробка сайту', 'створення сайту', 'дизайн сайту', 'розробка сайтів',
        'адаптивний дизайн', 'веб розробка', 'фронтенд', 'бекенд',
        'створення вебсайтів', 'разработка сайта', 'создание сайта',
        'дизайн сайта', 'создание сайтов', 'адаптивный дизайн',
        'веб разработка', 'фронтенд', 'бэкенд', 'создание вебсайтов', 'розробка сайтів',
        'веб-розробка', 'створення сайтів', 'дизайн сайтів', 'створення веб-сайтів', 'веб-дизайн', 'будівництво сайтів',
        'інтерфейс користувача', 'UX дизайн', 'UI дизайн', 'фронтенд розробка', 'бекенд розробка',
        'повна розробка веб-сайту', 'захист сайтів', 'SEO оптимізація', 'оптимізація сайту', 'мобільна адаптація',
        'доступність сайту', 'CMS розробка', 'WordPress розробка', 'E-commerce рішення', 'інтернет-магазини', 'дизайн інтерфейсу',
        'фреймворки для веб-розробки', 'HTML розробка', 'CSS стилізація', 'JavaScript програмування', 'бази даних для веб-додатків',
        'дизайн UX/UI', 'доступність веб-сайту', 'аналітика веб-сайту', 'веб-сервіси', 'додатки для мобільних пристроїв', 'інтеграція API',
        'веб-інтерфейси', 'дизайн адаптивного веб-сайту', 'онлайн-платформи', 'програмування на PHP', 'веб-сайти на Python', 'досвід користувача',
        'засоби веб-аналітики', 'інтерфейс адміністратора', 'тестування веб-сайтів', 'системи управління контентом', 'редагування сайтів', 'автоматизація веб-процесів',
        'переклад сайтів', 'фронтенд фреймворки', 'бекенд технології', 'дизайн мікросервісів', 'створення веб-додатків', 'програмування веб-додатків', 'мобільна версія сайту',
        'оптимізація завантаження', 'інструменти для веб-розробки', 'аналітика трафіку', 'веб-додатки для бізнесу', 'інтерактивні веб-сайти', 'дизайн візуалізації', 'підтримка веб-сайту',
        'графічний дизайн для вебу', 'створення лендингів', 'створення форм', 'програмування бази даних', 'забезпечення безпеки веб-сайту', 'проектування архітектури веб-сайту', 'веб-дизайн для стартапів',
        'веб-інструменти', 'онлайн маркетинг', 'оптимізація контенту', 'веб-хостинг', 'маркетинг через сайт', 'аналітика конверсій', 'управління проектами в веб-розробці', 'website development', 'web development',
        'website creation', 'website design', 'site creation', 'web design', 'building websites', 'user interface', 'UX design', 'UI design', 'frontend development', 'backend development', 'full stack development',
        'website security', 'SEO optimization', 'website optimization', 'mobile responsiveness', 'website accessibility', 'CMS development', 'WordPress development', 'E-commerce solutions', 'online stores', 'interface design',
        'web development frameworks', 'HTML development', 'CSS styling', 'JavaScript programming', 'databases for web applications', 'UX/UI design', 'website accessibility', 'website analytics', 'web services', 'mobile applications',
        'API integration', 'web interfaces', 'responsive web design', 'online platforms', 'PHP programming', 'Python websites', 'user experience', 'web analytics tools', 'admin interface', 'website testing', 'content management systems',
        'website editing', 'web process automation', 'website translation', 'frontend frameworks', 'backend technologies', 'microservices design', 'web applications development', 'web app programming', 'mobile site version', 'load optimization',
        'web development tools', 'traffic analytics', 'business web apps', 'interactive websites', 'visualization design', 'website maintenance', 'graphic design for web', 'landing page creation', 'form creation', 'database programming',
        'website security assurance', 'website architecture design', 'startup web design', 'web tools', 'online marketing', 'content optimization', 'web hosting', 'site marketing', 'conversion analytics', 'project management in web development',
        'разработка сайтов', 'веб-разработка', 'создание сайтов', 'дизайн сайтов', 'создание веб-сайтов', 'веб-дизайн', 'строительство сайтов', 'интерфейс пользователя', 'UX дизайн', 'UI дизайн', 'фронтенд разработка', 'бекенд разработка', 'полная разработка веб-сайта',
        'защита сайтов', 'SEO оптимизация', 'оптимизация сайта', 'мобильная адаптация', 'доступность сайта', 'CMS разработка', 'разработка на WordPress', 'E-commerce решения', 'интернет-магазины', 'дизайн интерфейса', 'фреймворки для веб-разработки', 'HTML разработка',
        'CSS стилизация', 'JavaScript программирование', 'базы данных для веб-приложений', 'дизайн UX/UI', 'доступность веб-сайта', 'аналитика веб-сайта', 'веб-сервисы', 'добавки для мобильных устройств', 'интеграция API', 'веб-интерфейсы', 'дизайн адаптивного веб-сайта',
        'онлайн-платформы', 'программирование на PHP', 'веб-сайты на Python', 'опыт пользователя', 'инструменты веб-аналитики', 'интерфейс администратора', 'тестирование веб-сайтов', 'системы управления контентом', 'редактирование сайтов', 'автоматизация веб-процессов',
        'перевод сайтов', 'фронтенд фреймворки', 'бекенд технологии', 'дизайн микросервисов', 'создание веб-приложений', 'программирование веб-приложений', 'мобильная версия сайта', 'оптимизация загрузки', 'инструменты для веб-разработки', 'аналитика трафика',
        'веб-приложения для бизнеса', 'интерактивные веб-сайты', 'дизайн визуализации', 'поддержка веб-сайта', 'графический дизайн для веба', 'создание лендингов', 'создание форм', 'программирование базы данных', 'обеспечение безопасности веб-сайта', 'проектирование архитектуры веб-сайта',
        'веб-дизайн для стартапов', 'веб-инструменты', 'онлайн маркетинг', 'оптимизация контента', 'веб-хостинг', 'маркетинг через сайт', 'аналитика конверсий', 'управление проектами в веб-разработке'
    ],
    '#ai': [
        'AI solutions', 'artificial intelligence', 'business transformation', 'AI for business', 'automation',
        'AI technology', 'intelligent solutions',
        'штучний інтелект', 'AI рішення', 'автоматизація бізнесу', 'інтелектуальні рішення',
        'AI технології', 'автоматизація',
        'искусственный интеллект', 'AI решения', 'автоматизация бизнеса',
        'интеллектуальные решения', 'AI технологии', 'автоматизация', 'AI рішення', 'штучний інтелект', 'машинне навчання',
        'глибоке навчання', 'нейронні мережі', 'обробка природної мови', 'компютерне бачення',
        'автоматизація процесів', 'розпізнавання образів', 'аналітика даних', 'AI в бізнесі',
        'AI у фінансах', 'AI у медицині', 'персоналізовані рекомендації', 'чати на базі AI',
        'автоматизація обслуговування клієнтів', 'AI для маркетингу', 'роботи', 'адаптивні системи',
        'автономні системи', 'AI в освіті', 'прогнозна аналітика', 'дослідження в AI', 'штучний інтелект для аналізу даних',
        'AI в інтернеті речей', 'глибоке навчання для зображень', 'AI для створення контенту', 'алгоритми машинного навчання',
        'AI для кібербезпеки', 'AI в розвагах', 'AI для обробки зображень', 'AI у геймі', 'автоматизовані системи', 'AI для розумного дому',
        'програми на базі AI', 'системи рекомендацій', 'AI для розпізнавання мовлення', 'AI для біометрії', 'AI в промисловості',
        'нейронні мережі для обробки зображень', 'AI для управління запасами', 'AI для розумного аналізу', 'технології AI', 'AI в автомобілях',
        'штучний інтелект для бізнесу', 'AI для покращення продуктивності', 'аналітика на основі AI', 'AI в гірничодобувній промисловості', 'AI для оптимізації виробництва',
        'AI для поліпшення якості обслуговування', 'AI в охороні здоровя',
        'AI для виявлення шахрайства', 'AI для прогнозування попиту', 'AI в обробці тексту',
        'AI для автоматизації управління проектами', 'AI для навчання', 'AI у фінансових послугах', 'AI для моніторингу безпеки', 'AI у спорті', 'AI solutions', 'artificial intelligence',
        'machine learning', 'deep learning', 'neural networks', 'natural language processing', 'computer vision', 'process automation', 'image recognition', 'data analytics', 'AI in business',
        'AI in finance', 'AI in healthcare', 'personalized recommendations', 'AI chatbots', 'customer service automation', 'AI for marketing', 'robots', 'adaptive systems', 'autonomous systems',
        'AI in education', 'predictive analytics', 'AI research', 'AI for data analysis', 'AI in the Internet of Things', 'deep learning for images', 'AI for content creation', 'machine learning algorithms',
        'AI for cybersecurity', 'AI in entertainment', 'AI for image processing', 'AI in gaming', 'automated systems', 'AI for smart homes', 'AI-based applications', 'recommendation systems', 'AI for speech recognition',
        'AI for biometrics', 'AI in industry', 'neural networks for image processing', 'AI for inventory management', 'AI for intelligent analytics', 'AI technologies', 'AI in cars', 'artificial intelligence for business',
        'AI for productivity enhancement', 'AI-based analytics', 'AI in mining', 'AI for production optimization', 'AI for service quality improvement', 'AI in healthcare', 'AI for fraud detection', 'AI for demand forecasting',
        'AI in text processing', 'AI for project management automation', 'AI for education', 'AI in financial services', 'AI for security monitoring', 'AI in sports', 'AI решения', 'искусственный интеллект', 'машинное обучение',
        'глубокое обучение', 'нейронные сети', 'обработка естественного языка', 'компьютерное зрение', 'автоматизация процессов', 'распознавание образов', 'аналитика данных', 'AI в бизнесе', 'AI в финансах', 'AI в медицине',
        'персонализированные рекомендации', 'AI чат-боты', 'автоматизация обслуживания клиентов', 'AI для маркетинга', 'роботы', 'адаптивные системы', 'автономные системы', 'AI в образовании', 'прогнозная аналитика', 'исследования в AI',
        'искусственный интеллект для анализа данных', 'AI в Интернете вещей', 'глубокое обучение для изображений', 'AI для создания контента', 'алгоритмы машинного обучения', 'AI для кибербезопасности', 'AI в развлечениях', 'AI для обработки изображений',
        'AI в играх', 'автоматизированные системы', 'AI для умного дома', 'программы на основе AI', 'системы рекомендаций', 'AI для распознавания речи', 'AI для биометрии', 'AI в промышленности', 'нейронные сети для обработки изображений', 'AI для управления запасами',
        'AI для интеллектуальной аналитики', 'технологии AI', 'AI в автомобилях', 'искусственный интеллект для бизнеса', 'AI для повышения производительности', 'аналитика на основе AI', 'AI в горной промышленности', 'AI для оптимизации производства',
        'AI для улучшения качества обслуживания', 'AI в здравоохранении', 'AI для обнаружения мошенничества', 'AI для прогнозирования спроса', 'AI в обработке текста', 'AI для автоматизации управления проектами', 'AI для обучения', 'AI в финансовых услугах',
        'AI для мониторинга безопасности', 'AI в спорте'


    ],
    '#web3': [
        'web3', 'crypto integration', 'blockchain solutions', 'decentralized systems',
        'cryptocurrency', 'smart contracts', 'blockchain technology', 'DApps',
        'веб3', 'крипто інтеграція', 'блокчейн рішення', 'децентралізовані системи',
        'криптовалюта', 'смарт контракти', 'блокчейн технології', 'децентралізовані додатки',
        'веб3', 'крипто интеграция', 'блокчейн решения', 'децентрализованные системы',
        'криптовалюта', 'смарт контракты', 'блокчейн технологии', 'децентрализованные приложения','web3',
        'веб3', 'веб 3', 'криптоінтеграція', 'крипто интеграция', 'blockchain solutions', 'блокчейн-решения',
        'децентралізовані додатки', 'децентрализованные приложения', 'smart contracts', 'умные контракты',
        'NFT marketplace', 'NFT маркетплейс', 'цифрові активи', 'цифровые активы', 'cryptocurrency wallets',
        'криптовалютные кошельки', 'Ethereum', 'Ethereum', 'DeFi', 'децентрализовані фінанси',
        'децентрализованные финансы', 'блокчейн-технології', 'блокчейн-технологии', 'tokenomics',
        'токеноміка', 'токеномика', 'метавсесвіт', 'метавселенная', 'веб3-ігри', 'веб 3-игры',
        'цифрова ідентичність', 'цифровая идентичность', 'DAOs', 'DAO', 'розподілена технологія реєстрації',
        'распределенные технологии реестра', 'пір-ту-пір мережі', 'пиринговые сети', 'криптографічна безпека',
        'криптографическая безопасность', 'самостійна ідентичність', 'самостоятельная идентичность',
        'некомерційні токени', 'некоммерческие токены', 'NFTs', 'NFT', 'веб3 інфраструктура',
        'веб3 инфраструктура', 'міжмережевість', 'межсетевое взаимодействие', 'кросчейн рішення',
        'кроссчейн-решения', 'веб3 розробка', 'веб 3 разработка', 'протоколи', 'протоколы',
        'публічна ключова інфраструктура', 'публичная ключевая инфраструктура', 'криптоторгівля',
        'крипто-торговля', 'ICO', 'ICO', 'IDO', 'IDO', 'IEO', 'IEO',
        'стейкінг', 'стейкинг', 'yield farming', 'фермерство прибутків', 'ликвидити майнінг',
        'ликвидити-майнинг', 'цифрові валюти', 'цифровые валюты', 'веб3 браузери',
        'веб3 браузеры', 'монети конфіденційності', 'монеты конфиденциальности',
        'блокчейн аналітика', 'блокчейн аналитика', 'крипто регулювання', 'крипто регулирование',
        'цифрова власність', 'цифровое владение', 'суверенітет даних', 'суверенитет данных',
        'веб3 маркетинг', 'веб3 маркетинг', 'веб3 спільнота', 'веб3 сообщество',
        'криптоосвіта', 'криптообразование', 'веб3 стартапи', 'веб3 стартапы',
        'блокчейн для соціального блага', 'блокчейн для социального блага', 'децентралізоване управління',
        'децентрализованное управление', 'веб3 тенденції', 'веб3 тенденции',
        'криптоадоптація', 'крипто-адоптация', 'рівень 2 рішення', 'решения второго уровня',
        'роллапи', 'роллы', 'сайдчейни', 'сайдчейны', 'веб3 протоколи', 'веб3 протоколы',
        'токен стандарти', 'стандарты токенов', 'ERC20', 'ERC20', 'ERC721', 'ERC721',
        'ERC1155', 'ERC1155', 'фунгібельні токени', 'фунгируемые токены',
        'криптомаркетплейси', 'крипто маркетплейсы', 'криптобіржі', 'криптобиржи',
        'веб3 інвестиції', 'веб3 инвестиции', 'кравфандинг', 'краудфандинг',
        'рекурсивні кредити', 'рекурсивные кредиты', 'стабільні монети', 'стабильные монеты',
        'крипто-регулювання', 'крипто-регулирование', 'веб3 API', 'веб3 API',
        'аудити смарт-контрактів', 'аудит смарт-контрактов', 'безпекові токени',
        'токены безопасности', 'масштабованість блокчейну', 'масштабируемость блокчейна',
        'транзакційні збори', 'транзакционные сборы', 'веб3 фреймворки',
        'веб3 фреймворки', 'блокчейн платформи', 'блокчейн платформы',
        'корпоративний блокчейн', 'корпоративный блокчейн', 'цифрові сертифікати',
        'цифровые сертификаты', 'криптофілантропія', 'криптофилантропия',
        'NFT мистецтво', 'NFT искусство', 'веб3 аналітика', 'веб3 аналитика',
        'блокчейн-ігри', 'блокчейн-игры', 'криптоінновації', 'криптоинновации',
        'веб3 інструменти', 'веб3 инструменты', 'крипто події', 'крипто события',
        'криптоінфлюенсери', 'криптоинфлюенсеры', 'проекти, що керуються спільнотою',
        'проекты, управляемые сообществом', 'веб3 виклики', 'веб3 вызовы',
        'децентралізоване зберігання', 'децентрализованное хранение', 'IPFS',
        'IPFS', 'Filecoin', 'Filecoin', 'веб3 конфіденційність', 'веб3 конфиденциальность',
        'блокчейн-консалтинг', 'блокчейн-консалтинг', 'крипто новини',
        'крипто новости', 'веб3 освіта', 'веб3 образование',
        'блокчейн-партнерства', 'блокчейн-партнёрства', 'цифрова трансформація',
        'цифровая трансформация', 'веб3 користувацький досвід',
        'веб3 пользовательский опыт', 'веб3 монетизація', 'веб3 монетизация',
        'використання блокчейну', 'использование блокчейна', 'тренди крипто ринку',
        'тренды крипто рынка', 'децентралізовані біржі', 'децентрализованные биржи',
        'криптокредитування', 'крипто-кредитование', 'NFT утиліти',
        'NFT-утилиты', 'веб3 проекти', 'веб3 проекты',
        'керування DAO', 'управление DAO', 'крипто події', 'крипто события',
        'блокчейн семінари', 'блокчейн семинары', 'веб3 подкасти',
        'веб3 подкасты', 'NFT-ігри', 'NFT-игры', 'оновлення регулювання крипто'

    ],
    '#cybersecurity': [
        'cybersecurity', 'data protection', 'system security', 'cyber protection',
        'information security', 'secure systems', 'IT security',
        'кібербезпека', 'захист даних', 'безпека систем', 'кіберзахист',
        'інформаційна безпека', 'захист системи', 'IT безпека',
        'кибербезопасность', 'защита данных', 'безопасность системы',
        'киберзащита', 'информационная безопасность', 'IT безопасность',  'cybersecurity',
        'кібербезпека', 'кибербезопасность', 'data protection', 'захист даних', 'cybersecurity', 'кібербезпека', 'кибербезопасность', 'data protection', 'захист даних',
    'защита данных', 'system security', 'безпека систем', 'безопасность систем',
    'cyber protection', 'кіберзахист', 'киберзащита', 'information security', 'інформаційна безпека',
    'информационная безопасность', 'secure systems', 'безпечні системи', 'безопасные системы',
    'IT security', 'ІТ безпека', 'ИТ безопасность', 'network security', 'мережна безпека',
    'сетевая безопасность', 'data breach', 'витік даних', 'утечка данных',
    'malware protection', 'захист від шкідливого ПЗ', 'защита от вредоносного ПО',
    'firewall', 'межа безпеки', 'межа безопасности', 'encryption', 'шифрування',
    'шифрование', 'penetration testing', 'тестування на проникнення', 'тестирование на проникновение',
    'security audit', 'аудит безпеки', 'аудит безопасности', 'cyber threats', 'кіберзагрози',
    'киберугрозы', 'vulnerability assessment', 'оцінка вразливостей', 'оценка уязвимостей',
    'incident response', 'реакція на інциденти', 'реакция на инциденты', 'risk management',
    'управління ризиками', 'управление рисками', 'identity theft', 'крадіжка особистості',
    'кража личности', 'access control', 'контроль доступу', 'контроль доступа',
    'data encryption', 'шифрування даних', 'шифрование данных', 'cloud security',
    'безпека хмари', 'безопасность облака', 'cyber resilience', 'кіберстійкість',
    'киберустойчивость', 'endpoint protection', 'захист кінцевих точок', 'защита конечных точек',
    'patch management', 'управління патчами', 'управление патчами', 'security policies',
    'політики безпеки', 'политики безопасности', 'two-factor authentication',
    'двохфакторна аутентифікація', 'двухфакторная аутентификация', 'secure coding',
    'безпечне кодування', 'безопасное кодирование', 'social engineering', 'соціальна інженерія',
    'социальная инженерия', 'cyber hygiene', 'кібергігієна', 'кибергигиена',
    'security awareness', 'усвідомлення безпеки', 'осведомленность о безопасности',
    'data integrity', 'цілісність даних', 'целостность данных', 'network monitoring',
    'моніторинг мережі', 'мониторинг сети', 'cyber law', 'кіберправо',
    'киберправо', 'information assurance', 'гарантія інформації', 'гарантия информации',
    'computer forensics', 'компютерна експертиза', 'компьютерная экспертиза',
    'security framework', 'рамка безпеки', 'рамка безопасности', 'cybersecurity standards',
    'стандарти кібербезпеки', 'стандарты кибербезопасности', 'biometric security',
    'біометрична безпека', 'биометрическая безопасность', 'data masking',
    'маскування даних', 'маскирование данных', 'security incident', 'інцидент безпеки',
    'инцидент безопасности', 'DDoS attack', 'атака DDoS', 'атака DDoS',
    'penetration testing tools', 'інструменти тестування на проникнення',
    'инструменты тестирования на проникновение', 'application security',
    'безпека додатків', 'безопасность приложений', 'cybersecurity training',
    'тренінг з кібербезпеки', 'обучение по кибербезопасности', 'threat intelligence',
    'інформація про загрози', 'информация о угрозах', 'spear phishing',
    'цільова фішинг-атака', 'целевая фишинг-атака', 'cybersecurity framework',
    'рамки кібербезпеки', 'рамки кибербезопасности', 'web application security',
    'безпека веб-додатків', 'безопасность веб-приложений', 'security operations center',
    'центр операцій безпеки', 'центр операций безопасности'

 ],
    '#branding': [
        'branding', 'logo design', 'brand identity', 'corporate identity',
        'brandbook', 'brand development', 'brand strategy', 'company identity',
        'business identity',
        'брендинг', 'розробка логотипу', 'корпоративна айдентика', 'брендбук',
        'айдентика компанії', 'бренд стратегії', 'бренд розвиток',
        'брендинг', 'разработка логотипа', 'корпоративная айдентика',
        'брендбук', 'айдентика компании', 'бренд стратегии', 'развитие бренда'
    ],
    '#presentation': [
        'presentation design', 'slide design', 'presentation creation',
        'infographic design', 'data visualization', 'presentation deck',
        'corporate presentations',
        'дизайн презентацій', 'створення презентацій', 'інфографіка',
        'візуалізація даних', 'корпоративні презентації', 'створення слайдів',
        'дизайн презентаций', 'создание презентаций', 'инфографика',
        'визуализация данных', 'корпоративные презентации', 'создание слайдов'
    ],
    '#animation': [
        '2D animation', '3D animation', 'character animation',
        'explainers', 'explainer videos', 'visual effects', 'VFX',
        'animated characters', 'product animation',
        '2D анімація', '3D анімація', 'персонажна анімація',
        'експлейнери', 'відео експлейнери', 'візуальні ефекти',
        'анімовані персонажі', 'анімація продукту',
        '2D анимация', '3D анимация', 'персонажная анимация',
        'эксплейнеры', 'видео эксплейнеры', 'визуальные эффекты',
        'анимированные персонажи', 'анимация продукта'
    ],
    '#videoediting': [
        'video editing', 'YouTube video editing', 'video montage',
        'commercials', 'training video', 'film editing',
        'video production', 'promotional videos', 'video ads',
        'редагування відео', 'монтаж відео', 'відео для YouTube',
        'рекламні ролики', 'створення відео', 'навчальні відео',
        'відео для курсів', 'відеореклама',
        'редактирование видео', 'монтаж видео', 'видео для YouTube',
        'рекламные ролики', 'создание видео', 'учебные видео',
        'видео для курсов', 'видеореклама'
    ],
    '#smm': [
        'social media design', 'content plan', 'visual creation',
        'social media posts', 'social media banners', 'Instagram design',
        'Facebook posts', 'YouTube banners',
        'дизайн для соцмереж', 'контент план', 'створення візуалів',
        'пости для соцмереж', 'банери для соцмереж', 'дизайн Instagram',
        'пости для Facebook',
        'дизайн для соцсетей', 'контент план', 'создание визуалов',
        'посты для соцсетей', 'баннеры для соцсетей',
        'дизайн Instagram', 'посты для Facebook'
    ],
    '#3ddesign': [
        '3D design', '3D modeling', 'product visualization',
        'interior design', 'architectural design', '3D graphics',
        '3D models', 'product design',
        '3D дизайн', '3D моделювання', 'візуалізація продукту',
        'дизайн інтер\'єрів', 'архітектурний дизайн', '3D графіка',
        '3D моделі', 'дизайн продукту',
        '3D дизайн', '3D моделирование', 'визуализация продукта',
        'дизайн интерьеров', 'архитектурный дизайн',
        '3D графика', '3D модели', 'дизайн продукта'
    ],
    '#illustration': [
        'illustration', 'character illustration', 'background illustration',
        'article illustration', 'artistic illustration',
        'custom illustrations', 'vector graphics',
        'ілюстрація', 'ілюстрації персонажів', 'фонові ілюстрації',
        'ілюстрації для статей', 'художні ілюстрації',
        'замовні ілюстрації', 'векторна графіка',
        'иллюстрация', 'иллюстрации персонажей', 'фоновые иллюстрации',
        'иллюстрации для статей', 'художественные иллюстрации',
        'заказные иллюстрации', 'векторная графика'
    ]
}


# Функція для пошуку ключових слів у повідомленні
def contains_keywords(message):
    for lang, words in keywords.items():
        for word in words:
            if re.search(r'\b' + re.escape(word) + r'\b', message, re.IGNORECASE):
                return lang  # Повертаємо тип послуги
    return None


# Обробка нових повідомлень у всіх чатах
@client.on(events.NewMessage)
async def handler(event):
    chat = await event.get_chat()
    chat_name = chat.title if chat.title else 'Приватний чат'

    sender = await event.get_sender()
    user_name = sender.username if sender.username else 'Unknown'
    user_id = sender.id

    message = event.message.message
    timestamp = event.message.date.strftime('%Y-%m-%d %H:%M:%S')

    # Перевіряємо наявність ключових слів
    service_type = contains_keywords(message)
    if service_type:
        # Форматування повідомлення
        lead_info = (
            f"💼 Потенційний лід виявлено:\n"
            f"🗨️ Повідомлення: {message}\n"
            f"🕒 Час: {timestamp}\n"
            f"👤 Від: @{user_name} (ID: {user_id})\n"
            f"🏷️ Чат: {chat_name}\n"  # Додано назву чату
            f"🔍 Тип послуги: {service_type}"
        )

        # Надсилаємо у ваш чат
        await client.send_message(target_chat_id, lead_info)


# Запуск клієнта
async def main():
    await client.start(phone_number)
    print("Бот запущений...")
    await client.run_until_disconnected()


with client:
    client.loop.run_until_complete(main())